In [23]:
#Import dependencis 
import pandas as pd
import matplotlib as plt
import sqlalchemy
from sqlalchemy import create_engine, func
import psycopg2

In [24]:
#create SQL Engine
user = "postgres"
#insert your password into this variable.
pw = "postgres"
engine = create_engine(f"postgresql://{user}:{pw}@localhost:5432/Pewlett_Hackard")
conn = engine.connect()

In [25]:
#NOTE: For reading purposes, I put it into multiple rows. 
#SQL statement
sql = "SELECT e.emp_no, s.salary " 
sql = sql + "FROM employees AS e "
sql = sql + "JOIN salaries AS s ON " 
sql = sql + "e.emp_no = s.emp_no "
sql = sql + "GROUP BY 1, 2 "
sql = sql + "ORDER BY 2 DESC;"

#This will execute the SQL statement above
emp_data = pd.read_sql(sql,conn)

emp_df = pd.DataFrame(emp_data)

emp_df.describe()

              emp_no         salary
count  300024.000000  300024.000000
mean   253321.763392   52970.732451
std    161828.235540   14301.478491
min     10001.000000   40000.000000
25%     85006.750000   40000.000000
50%    249987.500000   48681.000000
75%    424993.250000   61758.000000
max    499999.000000  129492.000000

In [28]:
#Create bin, for employee salaries
salary_bin = ['0 to 40k','41k to 70k','71k to 100k','101k to 120k','121k +']

#Adding the bin to the employees Dataframe
emp_df['bin'] = pd.cut(emp_df.salary,5,labels=salary_bin)

In [40]:
#Create groupby dataframe
emp_group = emp_df.groupby('bin')

salary_df = pd.DataFrame(emp_group['salary'].count())

salary_df

              salary
bin
0 to 40k      205522
41k to 70k     68411
71k to 100k    22774
101k to 120k    3156
121k +           161

In [ ]:
#Create histogram for salary ranges